<a href="https://colab.research.google.com/github/Drinkler/Yield-Prediction/blob/main/Yield_Prediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# General

In [38]:
# Imports
import numpy as np
import pandas as pd
import sklearn

In [39]:
# Load data
pesticides_data = pd.read_csv("../data/pesticides.csv", sep=',')
rainfall_data = pd.read_csv("../data/rainfall.csv", sep=', ')
temperature_data = pd.read_csv("../data/temp.csv", sep=', ')
yield_data = pd.read_csv("../data/yield.csv", sep=',')

/var/folders/rs/k96kcl4967qfyz3tlr5bk7th0000gn/T/ipykernel_28981/2259850279.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  rainfall_data = pd.read_csv("../data/rainfall.csv", sep=', ')
/var/folders/rs/k96kcl4967qfyz3tlr5bk7th0000gn/T/ipykernel_28981/2259850279.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  temperature_data = pd.read_csv("../data/temp.csv", sep=', ')

In [40]:
# Rain data in years for each country
# rainfall_data.head()
rainfall_df = rainfall_data.groupby(['Year', 'Country', 'ISO3'], as_index=False, axis=0).sum()
rainfall_df=rainfall_df.drop(["Statistics"], axis=1)
rainfall_df

       Year      Country ISO3  Rainfall - (MM)
0      1901  Afghanistan  AFG        250.92364
1      1901      Albania  ALB       1244.13740
2      1901      Algeria  DZA        113.45278
3      1901      Andorra  AND        871.31150
4      1901       Angola  AGO        931.01022
...     ...          ...  ...              ...
22731  2016    Venezuela  VEN       1844.70330
22732  2016      Vietnam  VNM       1988.86180
22733  2016        Yemen  YEM        171.48137
22734  2016       Zambia  ZMB        803.47810
22735  2016     Zimbabwe  ZWE        455.13295

[22736 rows x 4 columns]

In [41]:
# Average temperature data in years for each country
temperature_data = temperature_data.drop(["Statistics"], axis=1)
temperature_df =temperature_data.groupby(['Year', 'Country', 'ISO3'], as_index=False, axis=0).mean()
temperature_df

       Year      Country ISO3  Temperature - (Celsius)
0      1901  Afghanistan  AFG                13.172872
1      1901      Albania  ALB                11.030938
2      1901      Algeria  DZA                22.290008
3      1901      Andorra  AND                 9.960649
4      1901       Angola  AGO                21.365725
...     ...          ...  ...                      ...
22731  2016    Venezuela  VEN                26.478200
22732  2016      Vietnam  VNM                25.073158
22733  2016        Yemen  YEM                24.221200
22734  2016       Zambia  ZMB                22.737050
22735  2016     Zimbabwe  ZWE                22.310167

[22736 rows x 4 columns]

In [42]:
# Remove unnecessary columns
yield_df = yield_data.drop(['Domain', 'Element'], axis=1)
yield_df

              Area    Item  Year   Unit  Value
0      Afghanistan  Barley  1961  hg/ha  10800
1      Afghanistan  Barley  1962  hg/ha  10800
2      Afghanistan  Barley  1963  hg/ha  10800
3      Afghanistan  Barley  1964  hg/ha  10857
4      Afghanistan  Barley  1965  hg/ha  10857
...            ...     ...   ...    ...    ...
63686     Zimbabwe   Wheat  2015  hg/ha  20486
63687     Zimbabwe   Wheat  2016  hg/ha  19013
63688     Zimbabwe   Wheat  2017  hg/ha  17542
63689     Zimbabwe   Wheat  2018  hg/ha  16379
63690     Zimbabwe   Wheat  2019  hg/ha  15891

[63691 rows x 5 columns]

In [43]:
# Remove unnecessary columns
pesticides_df = pesticides_data.drop(['Domain', 'Element'], axis=1)
pesticides_df

          Area                Item  Year    Unit  Value
0      Albania  Pesticides (total)  1990  tonnes    121
1      Albania  Pesticides (total)  1991  tonnes    121
2      Albania  Pesticides (total)  1992  tonnes    121
3      Albania  Pesticides (total)  1993  tonnes    121
4      Albania  Pesticides (total)  1994  tonnes    201
...        ...                 ...   ...     ...    ...
4784  Zimbabwe  Pesticides (total)  2014  tonnes   2185
4785  Zimbabwe  Pesticides (total)  2015  tonnes   2185
4786  Zimbabwe  Pesticides (total)  2016  tonnes   2185
4787  Zimbabwe  Pesticides (total)  2017  tonnes   2185
4788  Zimbabwe  Pesticides (total)  2018  tonnes   2185

[4789 rows x 5 columns]

In [44]:
rainfall_df.rename({'Rainfall - (MM)': 'Rainfall (mm)'}, axis=1, inplace=True)
temperature_df.rename({'Temperature - (Celsius)': 'Temperature (Celsius)'}, axis=1, inplace=True)
yield_df.rename({'Area': 'Country', 'Value': 'Yield (hg/ha)'}, axis=1, inplace=True)
yield_df.drop('Unit', axis=1, inplace=True)
pesticides_df.rename({'Area': 'Country', 'Value': 'Pesticides (tonnes)'}, axis=1, inplace=True)
pesticides_df.drop(['Unit', 'Item'], axis=1, inplace=True)

In [45]:
rain_temp_df = pd.merge(rainfall_df, temperature_df, on=['Country', 'Year', 'ISO3'])
rain_temp_yield_df = pd.merge(rain_temp_df, yield_df, on=['Country', 'Year'])
rain_temp_yield_pest_df = pd.merge(rain_temp_yield_df, pesticides_df, on=['Country', 'Year'])
rain_temp_yield_pest_df.drop('ISO3', axis=1, inplace=True)
data = rain_temp_yield_pest_df[['Year', 'Country', 'Item', 'Rainfall (mm)', 'Temperature (Celsius)', 'Pesticides (tonnes)', 'Yield (hg/ha)']]
data

,Year,Country,Item,Rainfall (mm),Temperature (Celsius),Pesticides (tonnes),Yield (hg/ha)
0,1990,Albania,Barley,812.23450,12.051221,121,10000
1,1990,Albania,Carrots and turnips,812.23450,12.051221,121,150000
2,1990,Albania,Cauliflowers and broccoli,812.23450,12.051221,121,171429
3,1990,Albania,Garlic,812.23450,12.051221,121,65000
4,1990,Albania,Maize,812.23450,12.051221,121,36613
...,...,...,...,...,...,...,...
25224,2016,Zimbabwe,Maize,455.13295,22.310167,2185,4405
25225,2016,Zimbabwe,Oats,455.13295,22.310167,2185,20505
25226,2016,Zimbabwe,Potatoes,455.13295,22.310167,2185,51792
25227,2016,Zimbabwe,Sweet potatoes,455.13295,22.310167,2185,27283
25228,2016,Zimbabwe,Wheat,455.13295,22.310167,2185,19013

## One Hot Encoding

In [46]:
from sklearn.preprocessing import OneHotEncoder

df_onehot = pd.get_dummies(data, columns=['Country', 'Item'], prefix=['Country', 'Item'])
data = df_onehot.loc[:, df_onehot.columns != 'Yield (hg/ha)']
data['Yield (hg/ha)'] = df_onehot['Yield (hg/ha)']

In [47]:
from sklearn.preprocessing import MinMaxScaler

y = data['Yield (hg/ha)']
X = data.drop('Yield (hg/ha)', axis=1)

scaler = MinMaxScaler()
data_without_yield = pd.DataFrame(scaler.fit_transform(X), index=y.index)
data_without_yield.columns = X.columns
data_without_yield.insert(len(data_without_yield.columns), 'Yield (hg/ha)', y)

data = data_without_yield

In [48]:
y = data['Yield (hg/ha)']
X = data.drop('Yield (hg/ha)', axis=1)

In [49]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [50]:
def mean_absolute_percentage_error(y_true, y_pred): 
    y_true, y_pred = np.array(y_true), np.array(y_pred)
    return np.mean(np.abs((y_true - y_pred) / y_true)) * 100

In [51]:
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error, max_error
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import cross_validate, cross_val_predict
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import LabelEncoder

import time
from scipy.stats import linregress

rfr = RandomForestRegressor()

estimators = [('Random Forest Regression', rfr)]
for (name, est) in estimators:
  est.fit(X_train, y_train)
  y_pred = est.predict(X_test)

In [52]:
r2_values = []
max_error_values = []
neg_mean_absolute_error_values = []
neg_mean_squared_error_values = []
neg_root_mean_squared_error_values = []

for name, est in estimators:
  score = cross_validate(est, X_train, y_train, cv=5,
                         scoring=['r2', 'max_error', 'neg_mean_absolute_error', 'neg_mean_squared_error', 'neg_root_mean_squared_error'],
                         n_jobs=-1)

  r2_values.append(score['test_r2'])
  max_error_values.append(-score['test_max_error'])
  neg_mean_absolute_error_values.append(-score['test_neg_mean_absolute_error'])
  neg_mean_squared_error_values.append(-score['test_neg_mean_squared_error'])
  neg_root_mean_squared_error_values.append(-score['test_neg_root_mean_squared_error'])

In [53]:
regression = 0

print(u'R²: {:.3f} \u00B1 {:.3f}'.format(np.mean(r2_values[regression]), np.std(r2_values[regression])))
print(u'MAX: {:,.0f} \u00B1 {:,.0f}'.format(np.mean(max_error_values[regression]), np.std(max_error_values[regression])))
print(u'MAE: {:,.0f} \u00B1 {:,.0f}'.format(np.mean(neg_mean_absolute_error_values[regression]), np.std(neg_mean_absolute_error_values[regression])))
print(u'MSE: {:,.0f} \u00B1 {:,.0f}'.format(np.mean(neg_mean_squared_error_values[regression]), np.std(neg_mean_squared_error_values[regression])))
print(u'RMSE: {:,.0f} \u00B1 {:,.0f}'.format(np.mean(neg_root_mean_squared_error_values[regression]), np.std(neg_root_mean_squared_error_values[regression])))

R²: 0.940 ± 0.007
MAX: 518,650 ± 207,590
MAE: 11,859 ± 520
MSE: 682,227,604 ± 135,462,375
RMSE: 26,004 ± 2,454